tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf4410_tdd.h
#define RSEN                          522
#define PEN                           523
#define RCEN                          524
#define ACKEN                         525
#define ACKDT                         526
#define ACKSTAT                       527
#define GCEN                          528
#define SSPCON1                       529
#define SSPM0                         530
#define SSPM                          531
#define SSPM1                         532
#define SSPM2                         533
#define SSPM3                         534
#define CKP                           535
#define SSPEN                         536
#define SSPOV                         537
#define WCOL                          538
#define SSPSTAT                       539
#define BF                            540
#define UA                            541
#define R_NOT_W                       542
#define NOT_W                         543
#define nW                            544
#define RW                            545
#define nWRITE                        546
#define R                             547
#define W                             548
#define NOT_WRITE                     549
#define R_nW                          550
#define R_W                           551
#define START                         552
#define S                             553
#define STOP                          554
#define P                             555
#define A                             556
#define NOT_A                         557
#define nA                            558
#define D_A                           559
#define D_nA                          560
#define D                             561
#define DA                            562
#define D_NOT_A                       563
#define NOT_ADDRESS                   564
#define nADDRESS                      565
#define CKE                           566
#define SMP                           567
#define T2CON                         568
#define T2CKPS0                       569
#define T2CKPS                        570
#define T2CKPS1                       571
#define TMR2ON                        572
#define T2OUTPS0                      573
#define TOUTPS0                       574
#define TOUTPS                        575
#define T2OUTPS1                      576
#define TOUTPS1                       577
#define T2OUTPS2                      578
#define TOUTPS2                       579
#define T2OUTPS3                      580
#define TOUTPS3                       581
#define PR2                           582
#define WM0                           583
#define WM1                           584
#define WAIT0                         585
#define WAIT1                         586
#define EBDIS                         587
#define T1CON                         588
#define TMR1ON                        589
#define TMR1CS                        590
#define NOT_T1SYNC                    591
#define T1SYNC                        592
#define nT1SYNC                       593
#define T1OSCEN                       594
#define SOSCEN                        595
#define T1CKPS0                       596
#define T1CKPS                        597
#define T1CKPS1                       598
#define T1RUN                         599
#define T1CON_RD16                    600
#define T1RD16                        601
#define RCON                          602
#define BOR                           603
#define NOT_BOR                       604
#define nBOR                          605
#define POR                           606
#define nPOR                          607
#define NOT_POR                       608
#define PD                            609
#define nPD                           610
#define NOT_PD                        611
#define NOT_TO                        612
#define nTO                           613
#define TO                            614
#define nRI                           615
#define NOT_RI                        616
#define RI                            617
#define SBOREN                        618
#define IPEN                          619
#define WDTCON                        620
#define SWDTE                         621
#define SWDTEN                        622
#define HLVDCON                       623
#define HLVDL                         624
#define HLVDL0                        625
#define LVV0                          626
#define LVDL0                         627
#define HLVDL1                        628
#define LVDL1                         629
#define LVV1                          630
#define HLVDL2                        631
#define LVV2                          632
#define LVDL2                         633
#define HLVDL3                        634
#define LVV3                          635
#define LVDL3                         636
#define HLVDEN                        637
#define LVDEN                         638
#define BGST                          639
#define IRVST                         640
#define IVRST                         641
#define VDIRMAG                       642
#define OSCCON                        643
#define SCS0                          644
#define SCS                           645
#define SCS1                          646
#define FLTS                          647
#define IOFS                          648
#define OSTS                          649
#define IRCF                          650
#define IRCF0                         651
#define IRCF1                         652
#define IRCF2                         653
#define IDLEN                         654
#define T0CON                         655
#define T0PS                          656
#define T0PS0                         657
#define T0PS1                         658
#define T0PS2                         659
#define PSA                           660
#define T0PS3                         661
#define T0SE                          662
#define T0CS                          663
#define T08BIT                        664
#define T016BIT                       665
#define TMR0ON                        666
#define STATUS                        667
#define C                             668
#define CARRY                         669
#define DC                            670
#define ZERO                          671
#define Z                             672
#define OV                            673
#define OVERFLOW                      674
#define N                             675
#define NEGATIVE                      676
#define INTCON3                       677
#define INT1IF                        678
#define INT1F                         679
#define INT2IF                        680
#define INT2F                         681
#define INT1E                         682
#define INT1IE                        683
#define INT2IE                        684
#define INT2E                         685
#define INT1P                         686
#define INT1IP                        687
#define INT2IP                        688
#define INT2P                         689
#define INTCON2                       690
#define RBIP                          691
#define TMR0IP                        692
#define INTEDG2                       693
#define INTEDG1                       694
#define INTEDG0                       695
#define RBPU                          696
#define NOT_RBPU                      697
#define nRBPU                         698
#define INTCON                        699
#define RBIF                          700
#define INT0F                         701
#define INT0IF                        702
#define T0IF                          703
#define TMR0IF                        704
#define RBIE                          705
#define INT0E                         706
#define INT0IE                        707
#define T0IE                          708
#define TMR0IE                        709
#define PEIE                          710
#define PEIE_GIEL                     711
#define GIEL                          712
#define GIE_GIEH                      713
#define GIE                           714
#define GIEH                          715
#define SP0                           716
#define STKPTR                        717
#define SP1                           718
#define SP2                           719
#define SP3                           720
#define SP4                           721
#define STKUNF                        722
#define STKOVF                        723
#define STKFUL                        724

#endif // _PIC18LF4410_H_
